
/////////////////////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

&НаСервере
Процедура ПоказатьФайл()
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда 
	
		МенеджерЗаписи = РегистрыСведений.bitmobile_ХранилищеФайлов.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Элементы.Список.ТекущаяСтрока);
		
		МенеджерЗаписи.Прочитать();
		
		ДвоичныеДанныеФайла = МенеджерЗаписи.Хранилище.Получить();
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеФайла) Тогда 
			
			Предпросмотр = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
			
		Иначе 
			
			Путь	= Константы.bitmobile_ПутьНаСервере.Получить();
			Путь	= СтрЗаменить(Путь, "admin/", "webdav");
						
			Соединение = CommonProcessors.GetConnectionToServer();
			
			Если Не Соединение = Неопределено Тогда 
				
				Попытка
					
					WebDAVФайл = ПолучитьИмяВременногоФайла(МенеджерЗаписи.Расширение);
					
					Соединение.Получить(Путь + МенеджерЗаписи.ПолноеИмяФайла, WebDAVФайл);
					
					ДвоичныеДанныеФайла = Новый ДвоичныеДанные(WebDAVФайл);
					
					Предпросмотр = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
					
				Исключение
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
 
/////////////////////////////////////////////////////////////////////////////////////////////////
// Командный интерфейс

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ОтображатьПредпросмотр Тогда
		
		ПоказатьФайл();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПредпросмотрПриИзменении(Элемент)
	
	Если ОтображатьПредпросмотр Тогда
		
		ПоказатьФайл();
		
	Иначе 
		
		Предпросмотр = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры
