
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрSR = Новый ПараметрКомпоновкиДанных("SR");
	ЗначениеПараметраSR = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрSR);
	Если ЗначениеПараметраSR <> Неопределено Тогда
		ЗначениеПараметраSR.Значение = SR;
		ЗначениеПараметраSR.Использование = Истина;
	КонецЕсли;
	
	ПараметрSRList = Новый ПараметрКомпоновкиДанных("SRList");
	ЗначениеПараметраSRList = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрSRList);
	Если ЗначениеПараметраSRList <> Неопределено Тогда
		ЗначениеПараметраSRList.Значение = SRList;
		ЗначениеПараметраSRList.Использование = Истина;
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
		
		СхемаКомпоновкиДанных = Отчеты.VisitEfficiency.ПолучитьМакет("MainDataCompositionSchema");
		ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
	
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки(),
		ДанныеРасшифровки
	);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		ДанныеРасшифровки
	);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();	
КонецПроцедуры
 