
/////////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для обеспечения синхронизации файлов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВсеДокументы 	= Истина;
	ВсеСправочники 	= Истина;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

&НаСервереБезКонтекста
Процедура ВыгрузитьДанныеВФайлСервер(ВсеДанные, АдресВХ, ИмяФайла, ВыбраннаяНастройка, ТекстВидОбъекта)
	
	Обработки.bitmobile_СинхронизацияИНастройки.ВыгрузитьДанные(ВсеДанные, Истина, АдресВХ, ВыбраннаяНастройка, ТекстВидОбъекта);
		
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////
// Командный интерфейс

&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресВХ = "";
	
	ВыгрузкаЗавершена = Ложь;
	
	НастройкаКПередаче = Неопределено;

	ТекстВидОбъекта = "";
	
	Если Не ВсеДокументы И Не ВсеСправочники И Не ЗначениеЗаполнено(Настройка) Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указаны параметры выгрузки.";
		Сообщение.Сообщить();
		
		Возврат;
		
	ИначеЕсли Не ВсеДокументы И Не ВсеСправочники И ЗначениеЗаполнено(Настройка) Тогда
		
		НастройкаКПередаче = Настройка;
		
	ИначеЕсли Не ВсеДокументы И ВсеСправочники И Не ЗначениеЗаполнено(Настройка) Тогда	
		
		ТекстВидОбъекта = "Catalog";
		
	ИначеЕсли ВсеДокументы И Не ВсеСправочники И Не ЗначениеЗаполнено(Настройка) Тогда	
		
		ТекстВидОбъекта = "Document";	
		
	КонецЕсли;	
	
	ВыгрузитьДанныеВФайлСервер(Истина, АдресВХ, ИмяФайла, НастройкаКПередаче, ТекстВидОбъекта);
	
	Если ЗначениеЗаполнено(АдресВХ) Тогда  
		
		ПолучитьФайл(АдресВХ, "data.xml", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументыПриИзменении(Элемент)
	
	Если ВсеДокументы Тогда 
		
		Настройка = Неопределено;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВсеСправочникиПриИзменении(Элемент)
	
	Если ВсеСправочники Тогда 
		
		Настройка = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Настройка) Тогда 
		
		ВсеДокументы 	= Ложь;
		ВсеСправочники 	= Ложь;
		
	КонецЕсли;
		
КонецПроцедуры




