
/////////////////////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

&НаСервере
Процедура ОчиститьРегистрСервер()
	
	Обработки.bitmobile_СинхронизацияИНастройки.ОчиститьРегистрОшибок();
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////
// Командный интерфейс

&НаКлиенте
Процедура ОчиститьРегистр(Команда)
	
	ОчиститьРегистрСервер();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
